Tecnologia/26313433.md

Suport Tècnic : HÈSTIA - INTEGRACIÓ - Integració amb el servei  

1.  [Suport Tècnic](index.html)
2.  [Suport Tècnic](13893782.html)
3.  [02 - FAQ's serveis](26313393.html)
4.  [FAQ's HÈSTIA](28705593.html)

Suport Tècnic : HÈSTIA - INTEGRACIÓ - Integració amb el servei
==============================================================

Created by Unknown User (cmoralea), last modified by Cristian Morales on 20 December 2023

Procediment d'integració amb el servei d'Hèstia

  

Primera acció

Abans de res, validar que es pugui integrar l'entitat: [Hèstia - Ens que es poden integrar](26313252.html) si no, traslladar a Cap de Servei indicant que no surt al llistat i es vol integrar.

Més d'un proveïdor pot demanar integració pel mateix ens, en aquest cas si ja està integrat, el que hem de configurar és el CDA.

Accions a realitzar
-------------------

En el cas que l'Ens demandant depengui d'una ABSS i no es pugui integrar directament ho hem de comunicar.

  

Missatge tancament

Benvolguts, hem revisat el vostre cas i podem confirmar que no us podeu integrar directament per consumir el servei d'Hèstia, sinó que ho haureu de fer a través de l'ABSS que us pertoca, en el vostre cas XXX.

Salutacions,

  

Una vegada confirmem que l'ens és una de les  Àrees bàsiques de serveis socials que surt al llistat que ens va facilitar la Belén Álvarez, verifiquem que ens adjunta el document d'Integració (**signat digitalment per l'ajuntament** → En cas contrari l'hem de demanar que ha d'estar signat) amb les IPs i el CDA.

En cas contrari, l'hi demanarem:

Missatge demanar informació

Benvolgut,

Per tal de procedir amb la integració necessitem en primer lloc disposar d'un formulari d'integració signat per l'ens que es vulgui integrar, en aquest cas **XXXXXXXXXXXXXXXXXXX**.

Per proporcionar-vos els permisos d’accés necessaris, també necessitem la clau pública del certificat d’aplicació (CDA) amb el qual signareu les peticions XML cap a les nostres plataformes. En el següent enllaç podeu descarregar el formulari d’integració on podeu informar aquestes IPs junt amb les altres dades necessàries, i ens el feu arribar signat digitalment:

[https://suport-integradors.aoc.cat/hc/ca/articles/4416407051665-Quines-dades-necessita-el-Consorci-AOC-per-integrar-me-amb-el-servei-](https://suport-integradors.aoc.cat/hc/ca/articles/4416407051665-Quines-dades-necessita-el-Consorci-AOC-per-integrar-me-amb-el-servei-)

En cas que us integreu via webservice per primera vegada amb els serveis del Consorci AOC, necessitareu la documentació d’integració de la Plataforma de Col·laboració Interadministrativa (PCI). La PCI és un conjunt de sistemes i components orientats a la total disponibilitat dels serveis, amb garanties de màxima seguretat en el servei i en l'accés a les dades.

La documentació següent conté les especificacions de la missatgeria de la PCI: [https://suport-integradors.aoc.cat/hc/ca/articles/7352984409757-Documentaci%C3%B3-gen%C3%A8rica-per-a-integrar-se-a-la-PCI](https://suport-integradors.aoc.cat/hc/ca/articles/7352984409757-Documentaci%C3%B3-gen%C3%A8rica-per-a-integrar-se-a-la-PCI)

Per a la integració amb l'Hèstia, en el següent enllaç trobareu la documentació necessària: [https://suport-hestia.aoc.cat/hc/ca/articles/4415411418001-Documentaci%C3%B3-de-suport-per-a-la-integraci%C3%B3-amb-el-servei-web-d-H%C3%A8stia](https://suport-hestia.aoc.cat/hc/ca/articles/4415411418001-Documentaci%C3%B3-de-suport-per-a-la-integraci%C3%B3-amb-el-servei-web-d-H%C3%A8stia)

Quedem a la vostra disposició per atendre qualsevol dubte o problema.

Salutacions.

  

Primerà acció abans de donar permissos

Una vegada tinguem el necessari i hàgim validat que tot és correcte, derivem el tiquet a Cap de Servei per informar que ens demanen integració l'ens XXXXXX.

Missatge a traslladar

Bon dia Belén,

Et traslladem tiquet per informar-te que ens demanen integració amb el servei Hèstia **l'Ajuntament de Vic** per l'empresa: Disctricte digital.

 Validem que el document d'integració està correctament signat (està en la carpeta de xarxa junt amb el CDA).

Si ens confirmes, els configurarem a PRE

 Salutacions cordials.

  

Rebut l'OK per la Cap de Servei, procedirem a realitzar la integració.

Hem de generar una carpeta amb el número d'FP i nom de l'ens a la ruta de xarxa :(Sharepoint) Tecnologia - SUPORT\_TECNIC\\SERVEIS\\Hèstia\\01 Integració\\99 Integracions on desarem el Document signat i el CDA adjunt.

  

Exemples de Peticions a Hestia en PRE

Perquè les peticions a Hestia en l'entorn de PRE siguin exitoses, l'ens haurà d'informar l'INE10 9821920002 en la sol·licitud, mentre que en dades d'autorització hauran d'informar el seu INE10.  
  
En resum, **en PRE s'autoritzen amb el seu INE10 però s'autentiquem com a AOC.**  
  
  
Exemple de Petició a PRE per la modalitat d'Hestia Consulta amb la seva resposta en cas que hagi estat exitosa:

Com realitzar les Peticions a PRE - WIP

  

**Petició Hestia a PRE - Modalitat HESTIA\_CONSULTA\_CIUTADA** Expand source

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:open="http://www.openuri.org/" xmlns:pet="http://gencat.net/scsp/esquemes/peticion">
   <soapenv:Header/>
   <soapenv:Body>
      <open:procesa>
         <ns1:Peticion xmlns:ns1="http://gencat.net/scsp/esquemes/peticion">
            <ns1:Atributos>
               <ns1:IdPeticion>TEST\_HESTIA\_CONSULTA\_8101410007-${=(long)(System.currentTimeMillis())}</ns1:IdPeticion>
               <ns1:NumElementos>1</ns1:NumElementos>
               <ns1:TimeStamp>2018-07-03T12:42:51.76</ns1:TimeStamp>
               <ns1:CodigoCertificado>HESTIA\_CONSULTA\_CIUTADA</ns1:CodigoCertificado>
               <ns1:CodigoProducto>HESTIA</ns1:CodigoProducto>
               <ns1:DatosAutorizacion>
                  <ns1:IdentificadorSolicitante>8100560009</ns1:IdentificadorSolicitante>
                  <ns1:NombreSolicitante>Consell Comarcal de l'Alta Ribagorça</ns1:NombreSolicitante>
                  <ns1:Finalidad>PROVES</ns1:Finalidad>
               </ns1:DatosAutorizacion>
               <ns1:Emisor>
                  <ns1:NifEmisor>Q0801175A</ns1:NifEmisor>
                  <ns1:NombreEmisor>Consorci AOC</ns1:NombreEmisor>
               </ns1:Emisor>
            </ns1:Atributos>
            <ns1:Solicitudes>
               <ns1:SolicitudTransmision>
                  <ns1:DatosGenericos>
                     <ns1:Emisor>
                        <ns1:NifEmisor>Q0801175A</ns1:NifEmisor>
                        <ns1:NombreEmisor>Consorci AOC</ns1:NombreEmisor>
                     </ns1:Emisor>
                     <ns1:Solicitante>
                        <ns1:IdentificadorSolicitante>9821920002</ns1:IdentificadorSolicitante>
                        <ns1:NombreSolicitante>Consell Comarcal de l'Alta Ribagorça</ns1:NombreSolicitante>
                        <ns1:Finalidad>PROVES</ns1:Finalidad>
                        <ns1:Consentimiento>Si</ns1:Consentimiento>
                        <ns1:Funcionario>
                           <ns1:NombreCompletoFuncionario>Ferran Esteve Palou</ns1:NombreCompletoFuncionario>
                           <ns1:NifFuncionario>37694104W</ns1:NifFuncionario>
                        </ns1:Funcionario>
                     </ns1:Solicitante>
                     <ns1:Titular>
                        <ns1:TipoDocumentacion>NIF</ns1:TipoDocumentacion>
                        <ns1:Documentacion>37694104W</ns1:Documentacion>
                        <ns1:NombreCompleto>Ferran Esteve Palou</ns1:NombreCompleto>
                     </ns1:Titular>
                     <ns1:Transmision>
                        <ns1:CodigoCertificado>HESTIA\_CONSULTA\_CIUTADA</ns1:CodigoCertificado>
                        <ns1:IdSolicitud>AOC-2018/000376765</ns1:IdSolicitud>
                        <ns1:FechaGeneracion>2018-11-09</ns1:FechaGeneracion>
                     </ns1:Transmision>
                  </ns1:DatosGenericos>
                  <ns1:DatosEspecificos>
                     <ns2:PCIConsultaCiutada xmlns:ns2="http://www.aoc.cat/hestia/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
                        <ns2:codiINE>9821920002</ns2:codiINE>
                        <ns2:idInternCiutada>370001147</ns2:idInternCiutada>
                     </ns2:PCIConsultaCiutada>
                  </ns1:DatosEspecificos>
               </ns1:SolicitudTransmision>
            </ns1:Solicitudes>
         </ns1:Peticion>
      </open:procesa>
   </soapenv:Body>
</soapenv:Envelope>

**Resposta - HESTIA\_CONSULTA\_CIUTADA** Expand source

<resultat>
	<codiResultat>0</codiResultat>
	<descripcio>El ciutadà s'ha localitzat correctament</descripcio>
</resultat>

  
Aquí tenim un altre exemple amb la modalitat d'HESTIA\_CITES:

**Petició Hestia a PRE - Modalitat HESTIA\_CITES** Expand source

<ns1:Peticion xmlns:ns1="http://gencat.net/scsp/esquemes/peticion">
	<ns1:Atributos>
		<ns1:IdPeticion>UBT-805690004-20210924122802</ns1:IdPeticion>
		<ns1:NumElementos>1</ns1:NumElementos>
		<ns1:TimeStamp>2021-09-24 12:28:02.000</ns1:TimeStamp>
		<ns1:CodigoCertificado>HESTIA\_CITES</ns1:CodigoCertificado>
		<ns1:CodigoProducto>HESTIA</ns1:CodigoProducto>
		<ns1:DatosAutorizacion>
			<ns1:IdentificadorSolicitante>805690004</ns1:IdentificadorSolicitante>
			<ns1:NombreSolicitante>Ajuntament de Castelldefels</ns1:NombreSolicitante>
			<ns1:Finalidad>PROVES</ns1:Finalidad>
		</ns1:DatosAutorizacion>
		<ns1:Emisor>
			<ns1:NifEmisor>P0805500F</ns1:NifEmisor>
			<ns1:NombreEmisor>Ajuntament de Castelldefels</ns1:NombreEmisor>
		</ns1:Emisor>
		<ns1:IdSolicitanteOriginal>805690004</ns1:IdSolicitanteOriginal>
		<ns1:NomSolicitanteOriginal>Ajuntament de Castelldefels</ns1:NomSolicitanteOriginal>
	</ns1:Atributos>
	<ns1:Solicitudes>
		<ns1:SolicitudTransmision>
			<ns1:DatosGenericos>
				<ns1:Emisor>
					<ns1:NifEmisor>P0805500F</ns1:NifEmisor>
					<ns1:NombreEmisor>Ajuntament de Castelldefels</ns1:NombreEmisor>
				</ns1:Emisor>
				<ns1:Solicitante>
					<ns1:IdentificadorSolicitante>9821920002</ns1:IdentificadorSolicitante>
					<ns1:NombreSolicitante>Ajuntament de Castelldefels</ns1:NombreSolicitante>
					<ns1:Finalidad>PROVES</ns1:Finalidad>
					<ns1:Consentimiento>Si</ns1:Consentimiento>
				</ns1:Solicitante>
				<ns1:Transmision>
					<ns1:CodigoCertificado>HESTIA\_CITES</ns1:CodigoCertificado>
					<ns1:IdSolicitud>UBT-805690004-20210924122802</ns1:IdSolicitud>
					<ns1:FechaGeneracion>2021-09-24</ns1:FechaGeneracion>
				</ns1:Transmision>
			</ns1:DatosGenericos>
			<ns1:DatosEspecificos>
				<ns2:DadesEspecifiques xmlns:ns2="http://www.aoc.cat/hestia/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
					<ns2:CodINE>9821920002</ns2:CodINE>
					<ns2:IdCites>841207329</ns2:IdCites>
					<ns2:DataInici/>
					<ns2:DataFi/>
				</ns2:DadesEspecifiques>
			</ns1:DatosEspecificos>
		</ns1:SolicitudTransmision>
	</ns1:Solicitudes>
</ns1:Peticion>

**Resposta - HESTIA\_CITES** Expand source

<Resultat>
	<CodiResultat>0</CodiResultat>
	<Descripcio>Les cites s'han localitzat correctament</Descripcio>
</Resultat>

  

  

Quan ens demanen alta del servei Hèstia, hem de realitzar una alta normal, autoritzant el servei a:

Autoritzem a totes les modalitats:

![](attachments/26313433/64979125.png)

[ST-14694](https://contacte.aoc.cat/browse/ST-14694?src=confmacro) - Data cannot be retrieved due to an unexpected error.

[![](download/resources/com.atlassian.confluence.plugins.confluence-view-file-macro:view-file-macro-resources/images/placeholder-medium-file.png)RE Integracions Hèstia.msg](/download/attachments/26313433/RE%20%20Integracions%20H%C3%A8stia.msg?version=1&modificationDate=1636039994042&api=v2)

Exemple PRE:

![](attachments/26313433/61931911.png)

Exemple PRO:

![](attachments/26313433/64979102.png)

  

Les IP's es configuren en APP, podem veure-ho especificat a la FAQ: [Global - Configuració d'IP's](26313331.html)

  

Missatge tancament PRE

Missatge de tancament:

Bon dia,

Hem acabat les configuracions per tal que pugueu consumir el servei a l'entorn de Pre-producció:

![](attachments/26313433/61931911.png)

El Consorci AOC, amb l'objectiu de facilitar el desenvolupament de les integracions, posa a la vostra disposició els següents clients d'exemple de la PCI, també hi podeu trobar el Document d'integració amb la PCI:

[https://suport-integradors.aoc.cat/hc/ca/articles/7352984409757-Documentaci%C3%B3-gen%C3%A8rica-per-a-integrar-se-a-la-PCI](https://suport-integradors.aoc.cat/hc/ca/articles/7352984409757-Documentaci%C3%B3-gen%C3%A8rica-per-a-integrar-se-a-la-PCI)

La documentació d'integració específica del servei sol·licitat, la teniu disponible a:

 [https://suport-hestia.aoc.cat/hc/ca/articles/4415411418001-Documentaci%C3%B3-de-suport-per-a-la-integraci%C3%B3-amb-el-servei-web-d-H%C3%A8stia](https://suport-hestia.aoc.cat/hc/ca/articles/4415411418001-Documentaci%C3%B3-de-suport-per-a-la-integraci%C3%B3-amb-el-servei-web-d-H%C3%A8stia)

PEr a poder realitzar consums a PRE heu d'informar el INE10 del AOC: 9821920002 a la missatgeria genèrica com en la especifica de la sol·licitud.

Restem a la vostra disposició per a resoldre qualsevol problema que pugui sorgir-vos durant la integració.

Salutacions,

Pas a Producció

Una vegada l'ens vulgui realitzar el pas a Producció hem de fer 2 accions:

1.  Validar que han fet proves correctes on les dades que informen en l'XML corresponen a l'ens en si i que la resposta obtinguda finalitza correctament (Ho pots mirar en: [HÈSTIA - INTEGRACIÓ - Homologació](64979225.html)).
2.  Traslladar a Cap de Servei, indicant que volen passar a PRO i ens esperem que ens doni l'OK per donar els permisos pertinents.

Missatge tancament PRO

Bon dia,

Hem acabat les configuracions per tal que pugueu consumir el servei a l'entorn de Producció:

![](https://intranet.aoc.cat/download/attachments/26313433/image2021-11-9_13-54-46.png?version=1&modificationDate=1636462485124&api=v2)

Restem a la vostra disposició per a resoldre qualsevol problema que pugui sorgir-vos durant la integració.

Salutacions,

Procediment comentat i tractat en el JIRA : [ST-8316](https://contacte.aoc.cat/browse/ST-8316?src=confmacro) - Data cannot be retrieved due to an unexpected error.

Related articles
----------------

  

Related issues

FP#265594

Attachments:
------------

![](images/icons/bullet_blue.gif) [image2019-7-16\_16-19-34.png](attachments/26313433/26314092.png) (image/png)  
![](images/icons/bullet_blue.gif) [image2019-7-16\_16-19-52.png](attachments/26313433/26314093.png) (image/png)  
![](images/icons/bullet_blue.gif) [image2019-7-17\_13-53-51.png](attachments/26313433/26315930.png) (image/png)  
![](images/icons/bullet_blue.gif) [Documentació Hèstia.zip](attachments/26313433/34505063.zip) (application/zip)  
![](images/icons/bullet_blue.gif) [image2021-10-18\_14-12-33.png](attachments/26313433/61931911.png) (image/png)  
![](images/icons/bullet_blue.gif) [image2021-10-18\_14-13-2.png](attachments/26313433/61931912.png) (image/png)  
![](images/icons/bullet_blue.gif) [image2021-11-4\_11-55-2.png](attachments/26313433/64979081.png) (image/png)  
![](images/icons/bullet_blue.gif) [RE Integracions Hèstia.msg](attachments/26313433/64979084.msg) (application/vnd.ms-outlook)  
![](images/icons/bullet_blue.gif) [image2021-11-9\_13-54-46.png](attachments/26313433/64979102.png) (image/png)  
![](images/icons/bullet_blue.gif) [image2021-11-11\_12-17-25.png](attachments/26313433/64979125.png) (image/png)  

Document generated by Confluence on 02 June 2025 10:56

[Atlassian](http://www.atlassian.com/)